{
  "name": "Join the Analytics Dojo Community",
  "order": 2,
  "time": "15 minutes",
  "helpRoom": "Help",
  "challenges": [
    {
      "id": "560add10ag82ac40a18392be",
      "title": "Choose and Setup an Analytics Platform",
      "description": [
        [
          "//i.imgur.com/LnreS3r.png",
          "A picture of an analytics platform",
          "You have begun your journey. Unlike a lot of <i>learn to code</i> sites that use in-browser tutorials, the AnalyticsDojo uses the same the same tools you are likely to use in a production environment.  This means that before we can get started, we have to go through a bit of setup of an analytics platform. An <i>analytics platform</i> is an environment in which you can execute programs, store data, and even create production web services or Application Programming Interfaces (APIs) that enable your application to be deployted to a production environment.",
          "",
          "This image adopted from FreeCodeCamp.com.",
          "http://freecodecamp.com"
        ],
        [
          "//i.imgur.com/WfiL6gn.jpg",
          "An image of a Jupyter Notebook",
          "All of the work that we are going to be doing will utilize Jupyter notebooks. Jupyter notebooks are a flexible computing enviroment that was origionally based on iPython notebooks.  The Jupyter team has done an amazing job bringing the notebook computing enviroment to a wide <a href='https://github.com/ipython/ipython/wiki/IPython-kernels-for-other-languages'>variety of languages including R, Python, Scala, and even SAS.</a>",
          "",
          "",
          ""
        ],
        [
          "//i.imgur.com/EMmq1DK.jpg",
          "An image several different analytics platforms.",
          "Currently there a wide variety of online platforms to do analytics using Jupyter notebooks. It is emerging as a powerful standand to do data science.  However, we want to focus our resources those platforms that are currently easy for beginners to get started.  You only need one platform, and we suggest becoming an expert in one. However,   ",
          "",
          "By Raysonho @ Open Grid Scheduler / Grid Engine (Own work) [CC0], via Wikimedia Commons",
          "https://commons.wikimedia.org/wiki/File%3AIBMComputerTrainingWorkshop.JPG"
        ],
        [
          "//i.imgur.com/vBlRCb7.png",
          "An illustration showing that you will learn Python, R, Statistics, Spark, Visualizations, Databases, Linked Data and Github.",
          "The AnalyticsDojo will take you through a wide variety of exercises, from the initial data manipulation (often called data munging) through modeling, visualization, and even deployment into applications .",
          ""
        ],
        [
          "//i.imgur.com/6MmQScx.png",
          "Text illustrating the top software tools and languages for data science.",
          "R and Python are now the top two languages for data science.  Why? They each have tremendous ecosystems which support packages that are taylored to data science.  They are also open source and free to get started.  The AnalyticsDojo will provide you with a strong foundation in both R and Python, and the tools that we will adopt frequently support both languages.<br><br> SPARK has seen tremendous growth because it provides an accessible language in which one can access the BIG DATA (i.e., Hadoop) ecosystem-which is also increasingly possible from Python and even R. Tableau is a beautifully designed tool that makes a great first introduction to visualization.  Scikit-learn may seem like a new language, but don't worry...it is just a machine learning library for Python.",
          "",
          "KDnuggets 2016 Software Poll Results",
          "http://bit.ly/kd2016top"
        ],
        [
          "//i.imgur.com/nfw3AAt.png",
          "A diagram showing the CRISP Model for data mining",
          "But whatever the tools you use, it is most important to understand when and why to apply them. While the 'how' can a challenge the when and why will take more time and we hope that by viewing a wide range of technologies and case studies these will become second nature. To frame the processes of addressing a data science problem, we will be using the Cross Industry Standard Process for Data Mining (CRISP) model to provide a guide. This breaks down analytics into manageable steps. For each, we may utilize different tools and technologies. But before we can get started with data science, let's start with some of the technologies we will be using for data science.",
          "",
          "By Kenneth Jensen (Own work) [CC BY-SA 3.0], via Wikimedia Commons",
          "https://commons.wikimedia.org/wiki/File%3ACRISP-DM_Process_Diagram.png"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    }


  ]
}
