{
  "name": "Computer Basics",
  "order": 0,
  "time": "2 hours",
  "challenges": [
    {
      "id": "bd7128d8c441eddfbeb5bddf",
      "title": "Computer Basics: The 4 Basic Parts of a Computer",
      "description": [
        "At the very least, a machine needs these four basic parts to be considered a computer.",
        "Today we're going to talk about the basics of computer hardware.",
        "Computers are made up of 4 basic parts: the input, output, CPU, and memory.",
        "The input is what you're putting into the computer.",
        "Think about mouse, keyboard, microphone, any way you're getting data into the computer.",
        "The output is what you're watching on your monitor or listening to on your speakers.",
        "These can both be any format like text, numbers, videos, images, what have you, it doesn't matter.",
        "CPU stands for central processing unit, and that's what we all think of when we think of a computer.",
        "It's what does the functions, it's what runs the software, it manipulates the data.",
        "The memory is where we store data and information.",
        "Now, the CPU has exclusive access to this memory.",
        "You can't get to the memory from the input or the output without the use of the CPU.",
        "So, just to review, we've got 4 basic parts of the computer: the input, the output, CPU, and memory."
      ],
      "challengeSeed": [
        "q7tlgZg4Q1o"
      ],
      "tests": [
        [
          "The computer only has 3 basic parts.",
          false,
          "The computer has 4 basic parts: input, output, CPU, and memory"
        ],
        [
          "CPU stands for Central Processing Unit.",
          true
        ],
        [
          "All parts can access the memory",
          false,
          "Only the CPU has access to the memory"
        ]
      ],
      "type": "hike",
      "challengeType": 6,
      "descriptionEs": [
        "Una máquina necesita por lo menos cuatro partes básicas para ser considerada un computador.",
        "Hoy vamos a hablar acerca de conceptos básicos de hardware.",
        "Los computadores se componen de 4 partes básicas: Los dispositivos de entrada, los dispositivos de salida, la CPU y la memoria.",
        "Los dispositivos de entrada te permiten ingresar información al computador.",
        "Piensa en el ratón, teclado, micrófono, con todos estos estás ingresando información al computador.",
        "Son ejemplos de dispositivos de salida tu monitor donde ves esto, o los altavoces que producen los sonidos que escuchas.",
        "La información que entra y sale por esos dispositivos puede estar en diversos formatos como texto, números, vídeos, imágenes, lo que tengas.",
        "CPU significa unidad central de procesamiento, y es en lo que todos pensamos cuando pensamos en un computador.",
        "Es lo que lo hace funcionar, es lo que ejecuta el software, es lo que manipula los datos.",
        "La memoria es donde almacenamos los datos y la información.",
        "Ahora, la CPU tiene acceso exclusivo a esta memoria.",
        "No se puede llegar a la memoria desde la entrada o desde la salida sin el uso de la CPU.",
        "Por lo tanto, sólo para repasar, tenemos 4 partes básicas de la computadora: los dispositivos de entrada, los dispositivos de salida, la CPU y la memoria."
      ],
      "titleEs": "Fundamentes básicos del computador: Las 4 partes básicas de un computador"
    },
    {
      "id": "bd7127d8c441eddfbeb5bddf",
      "title": "Computer Basics: More Computer Hardware",
      "description": [
        "In this video we cover the basic functions of a motherboard, expansion slots, and power supply.",
        "Let's quickly review - the 4 basic parts of a computer are the input, like the mouse or the keyboard, the output, which is seen on the monitor or heard on the speakers, the CPU, the central processing unit, and the memory.",
        "Now memory can be short term memory, called RAM, or longer term memory.",
        "That's usually as a hard drive, but it can also be a CD-ROM or a flash drive, anything like that.",
        "In addition to those four basic parts, we have three more things we're going to discuss today: the motherboard, expansion cards, and power supply.",
        "The motherboard is what connects everything.",
        "While the data's flying around over here trying to figure out where to go, the motherboard helps route it so it goes to the right place.",
        "Expansion cards are sound cards, video cards, that kind of thing that can really up your experience as a user.",
        "Power supply is, as it sounds, what gets power to the computer.",
        "It's usually that part that has a fan on it to keep it from overheating.",
        "So let's do a quick review.",
        "In addition to the four basic parts of input, output, CPU, and memory, we also usually have a motherboard, expansion cards, and a power supply."
      ],
      "challengeSeed": [
        "xj9mFD71Vfc"
      ],
      "tests": [
        [
          "The power supply isn't a necessary part of a computer since it's not one of the 4 main parts.",
          false,
          "The computer needs power!"
        ],
        [
          "A motherboard connects all of the working parts in a computer.",
          true
        ],
        [
          "Memory is usually categorized into 3 parts.",
          false,
          "Only 2 parts, RAM and long term memory such as a hard drive"
        ]
      ],
      "type": "hike",
      "challengeType": 6,
      "descriptionEs": [
        "En este video cubrimos las funciones básicas de una placa base, tarjetas de expansión, y la fuente de poder.",
        "Vamos a revisar rápidamente - las 4 partes básicas de un computador son dispositivos de entrada, como el ratón o el teclado, dispositivos de salida, monitor o altavoces, la CPU, la unidad central de procesamiento, y la memoria.",
        "Ahora la memoria puede ser memoria a corto plazo, llamada memoria RAM, o memoria de largo plazo.",
        "Eso es por lo general un disco duro, pero también puede ser un CD-ROM o una unidad flash, o algo por el estilo.",
        "Además de esas cuatro partes básicas, trataremos tres partes más hoy: La placa base, las tarjetas de expansión, y la fuente de poder",
        "La placa base es lo que conecta todo.",
        "Si bien los datos vuelan de un lado a otro tratando de averiguar a dónde ir, la placa base que ayuda a establecer rutas para que lleguen al lugar correcto.",
        "Las tarjetas de expansión son las tarjetas de sonido, las tarjetas de vídeo, ese tipo de cosas que pueden mejorar tu experiencia como usuario.",
        "La fuente de poder es, como suena, lo que le da energía a la computadora.",
        "Por lo general es la parte que tiene un ventilador en él para evitar que se sobrecaliente.",
        "Así que vamos a hacer un repaso rápido.",
        "Además de las cuatro partes básicas dispositivos de entrada, dispositivos de salida, CPU, y la memoria, también por lo general tenemos una placa base, las tarjetas de expansión, y una fuente de poder."
      ],
      "titleEs": "Fundamentos básicos del computador: Más Hardware"
    },
  ]
}
